//questions
const testItems = [
  {
    question: "Буває, що я серджуся",
  },
  {
    question: "Зазвичай вранці я прокидаюся свіжим і відпочилим",
  },
  {
    question: "Зараз я приблизно так само працездатний, як і завжди",
  },
  {
    question: "Доля безумовно несправедлива до мене",
  },
  {
    question: "Запори у мене бувають дуже рідко",
  },
  {
    question: "Часом мені дуже хотілося покинути свій дім",
  },
  {
    question:
      "Часом у мене бувають напади сміху або плачу, з якими я ніяк не можу справитися",
  },
  {
    question: "Мені здається, що мене ніхто не розуміє",
  },
  {
    question:
      "Вважаю, що якщо хтось заподіяв мені зло, я повинен йому відповісти тим же",
  },
  {
    question:
      "Іноді мені в голову приходять такі нехороші думки, що краще про них нікому не розказувати",
  },
  {
    question:
      "Іноді мені в голову приходять такі нехороші думки, що краще про них нікому не розказувати",
  },
  {
    question: "У мене бувають дуже дивні і незвичайні переживання",
  },
  {
    question: "У мене були відсутні неприємності через мою поведінку",
  },
  {
    question: "В дитинстві я у свій час скоював дрібні крадіжки",
  },
  {
    question:
      "Буває, у мене з’являється бажання ламати або крушити все навколо",
  },
  {
    question:
      "Бувало, що я цілими днями або навіть тижнями нічого не міг робити, тому що ніяк не міг примусити себе взятися до роботи",
  },
  {
    question: "Сон у мене переривистий і неспокійний",
  },
  {
    question:
      "Моя сім'я відноситися з несхваленням до тієї роботи, яку я обрав",
  },
  {
    question: "Бували випадки, що я не виконував своїх обіцянок",
  },
  {
    question: "Голова у мене болить часто",
  },
  {
    question:
      "Раз на тиждень або частіше я без жодної видимої причини раптово відчуваю жар у всьому тілі",
  },
  {
    question: "Було б добре, якби майже всі закони відмінили",
  },
  {
    question:
      "Стан мого здоров’я майже такий же, як у більшості моїх знайомих (не гірше)",
  },
  {
    question:
      "Зустрічаючи на вулиці своїх знайомих або шкільних друзів, з якими я давно не бачився, я вважаю за краще проходити мимо, якщо вони зі мною не заговорюють першими",
  },
  {
    question: "Більшості людей, які мене знають, я подобаюся",
  },
  {
    question: "Я людина товариська",
  },
  {
    question: "Іноді я так наполягаю на своєму, що люди втрачають терпіння",
  },
  {
    question: "Значну частину часу настрій у мене пригнічений",
  },
  {
    question:
      "Тепер мені важко сподіватися на те, що я чого-небудь досягну у житті",
  },
  {
    question: "У мене мало впевненості в собі",
  },
  {
    question: "Іноді я кажу неправду",
  },
  {
    question: "Зазвичай я вважаю, що життя – гарна річ",
  },
  {
    question:
      "Я вважаю, що більшість людей здатна збрехати, щоб просунутися по службі",
  },
  {
    question:
      "Я охоче беру участь у зібраннях, зборах і інших суспільних заходах",
  },
  {
    question: "Я сварюся з членами моєї сім’ї дуже рідко",
  },
  {
    question:
      "Іноді у мене виникає сильне бажання порушити правила пристойності або кому-небудь нашкодити",
  },
  {
    question: "Найважча боротьба для мене - це боротьба з самим собою",
  },
  {
    question:
      "М’язові судоми або сіпання у мене бувають украй рідко (або майже не бувають)",
  },
  {
    question: "Я досить байдужий до того, що зі мною буде",
  },
  {
    question: "Іноді, коли я себе недобре відчуваю я буваю дратівливим",
  },
  {
    question:
      "Значну частину часу у мене таке відчуття, що я зробив щось не те або навіть щось погане",
  },
  {
    question:
      "Деякі люди до того полюбляють командувати, що мені так і кортить робити все наперекір, навіть якщо я знаю, що вони мають рацію",
  },
  {
    question:
      "Я часто вважаю себе зобов'язаним відстоювати те, що вважаю справедливим",
  },
  {
    question:
      "Моя мова зараз така ж як завжди (ні швидше і ні повільніше, немає ні хрипоти, ні невиразності)",
  },
  {
    question:
      "Я вважаю, що моє сімейне життя таке ж добре, як у більшості моїх знайомих",
  },
  {
    question: "Мене вкрай зачіпає, коли мене критикують або лають",
  },
  {
    question:
      "Іноді у мене буває таке відчуття, що я просто повинен нанести ушкодження собі або кому-небудь іншому",
  },
  {
    question:
      "Моя поведінка значною мірою визначається звичаями тих, хто мене оточує",
  },
  {
    question:
      "В дитинстві у мене була така компанія, де всі прагнули стояти один за одного",
  },
  {
    question: "Іноді мені так і кортить з ким-небудь затіяти бійку",
  },
  {
    question: "Бувало, що я казав про речі, в яких не розбираюся",
  },
  {
    question: "Зазвичай я засинаю спокійно і мене не турбують ніякі думки",
  },
  {
    question: "Останні декілька років я відчуваю себе добре",
  },
  {
    question: "У мене ніколи не було ні припадків, ні судом",
  },
  {
    question: "Зараз моя вага постійна (я не худну і не повнішаю)",
  },
  {
    question: "Я вважаю, що мене часто карали нізащо",
  },
  {
    question: "Я легко плачу",
  },
  {
    question: "Я мало втомлююся",
  },
  {
    question:
      "Я був би досить спокійний, якби у кого-небудь з моєї сім'ї були неприємності через порушення закону",
  },
  {
    question: "З моїм розумом творитися щось недобре",
  },
  {
    question:
      "Щоб приховати свою сором'язливість мені доводиться докладати великі зусилля.",
  },
  {
    question:
      "Напади запаморочення у мене бувають дуже рідко (або майже не бувають)",
  },
  {
    question: "Мене турбують сексуальні (статеві) питання",
  },
  {
    question:
      "Мені важко підтримувати розмову з людьми, з якими я тільки що познайомився",
  },
  {
    question:
      "Коли я намагаюся щось зробити, то часто помічаю, що у мене тремтять руки",
  },
  {
    question: "Руки у мене такі ж спритні і моторні, як і раніше",
  },
  {
    question: "Велику частину часу я відчуваю загальну слабкість",
  },
  {
    question:
      "Іноді, коли я збентежений я сильно вкриваюся потом і мене це дратує",
  },
  {
    question: "Буває, що я відкладаю на завтра те, що повинен зробити сьогодні",
  },
  {
    question: "Думаю, що я людина приречена",
  },
  {
    question:
      "Бували випадки, що мені було важке утриматися від того, щоб що-небудь не поцупити в кого-небудь або де-небудь, наприклад у магазині",
  },
  {
    question: "Я зловживав спиртними напоями",
  },
  {
    question: "Я часто про що-небудь турбуюся",
  },
  {
    question: "Мені б хотілося бути членом декількох кружків або зборів",
  },
  {
    question: "Я рідко задихаюся, і у мене не буває сильного серцебиття",
  },
  {
    question:
      "Все своє життя я суворо дотримуюсь принципів, заснованих на почутті обов’язку",
  },
  {
    question:
      "Траплялося, що я перешкоджав або поступав наперекір людям просто із принципу, а не тому, що справа була дійсно важливою",
  },
  {
    question:
      "Якщо мені не загрожує штраф і машин поблизу немає, я можу перейти вулицю там, де бажаю, а не там де потрібно",
  },
  {
    question: "Я завжди був незалежним і вільним від контролю з боку сім'ї",
  },
  {
    question:
      "У мене бували періоди такої сильної стурбованості, що я навіть не міг всидіти на місці",
  },
  {
    question: "Часто мої вчинки тлумачилися не вірно",
  },
  {
    question:
      "Мої батьки і (або) інші члени моєї сім’ї прискіпуються до мене більше, ніж треба",
  },
  {
    question: "Хтось керує моїми думками",
  },
  {
    question: "Люди байдужі до того, що з тобою трапиться",
  },
  {
    question:
      "Мені подобається бути в компанії, де всі жартують один над одним",
  },
  {
    question: "В школі я засвоював матеріал повільніше, аніж інші",
  },
  {
    question: "Я цілком впевнений у собі",
  },
  {
    question: "Нікому не довіряти – найбезпечніше",
  },
  {
    question:
      "Раз на тиждень або частіше я буваю дуже збудженим і схвильованим",
  },
  {
    question:
      "Коли я знаходжуся в компанії, мені важко знайти відповідну тему для розмови",
  },
  {
    question:
      "Мені легко примусити інших людей боятися мене, і іноді я це роблю ради забави",
  },
  {
    question: "У грі я вважаю за краще вигравати",
  },
  {
    question:
      "Безглуздо засуджувати людину, яка обдурила того, хто сам дозволяє себе обдурювати",
  },
  {
    question: "Хтось намагається впливати на мої думки",
  },
  {
    question: "Я щодня випиваю багато води",
  },
  {
    question: "Щасливіше всього я буваю наодинці",
  },
  {
    question:
      "Я обурююся кожного разу, коли дізнаюся, що злочинець з якої-небудь  причини залишився безкарним",
  },
  {
    question:
      "У моєму житті був один або декілька випадків, коли я відчував, що хтось за допомогою гіпнозу примушує мене скоювати ті або інші вчинки",
  },
  {
    question: "Я дуже рідко заговорюю з людьми першим",
  },
  {
    question: "У мене ніколи не було зіткнень із законом",
  },
  {
    question:
      "Мені приємно мати серед своїх знайомих значних людей, це як би додає мені вагу у власних очах",
  },
  {
    question:
      "Іноді без жодної причини у мене раптом наступають періоди незвичайної веселості",
  },
  {
    question: "Життя для мене майже завжди пов'язано з напругою",
  },
  {
    question: "У школі мені було дуже важко виступати перед класом",
  },
  {
    question:
      "Люди проявляють по відношенні до мене стільки співчуття і симпатії, наскільки я заслуговую",
  },
  {
    question:
      "Я відмовляюся грати в деякі ігри, тому що це у мене погано виходить",
  },
  {
    question:
      "Мені здається, що я знаходжу друзів з такою ж легкістю, як і інші",
  },
  {
    question: "Мені неприємно, коли навколо мене є люди",
  },
  {
    question: "Як правило, мені не везе",
  },
  {
    question: "Мене легко збити з пантелику",
  },
  {
    question: "Деякі з членів моєї сім'ї скоювали вчинки, які мене лякали",
  },
  {
    question:
      "Іноді у мене бувають напади сміху або плачу, з якими я ніяк не можу справитися",
  },
  {
    question:
      "Мені важко приступити до виконання нового завдання або розпочати нову справу",
  },
  {
    question:
      "Якби люди не були налаштовані проти мене, я досягнув би у житті набагато більшого",
  },
  {
    question: "Мені здається, що мене ніхто не розуміє",
  },
  {
    question: "Серед моїх знайомих є люди, які мені не подобаються",
  },
  {
    question: "Я легко втрачаю терпіння з людьми",
  },
  {
    question: "Часто у новій обстановці я переживаю почуття тривоги",
  },
  {
    question: "Часто мені хочеться померти",
  },
  {
    question: "Іноді я такий збуджений, що мені важко заснути",
  },
  {
    question:
      "Часто я переходжу на іншу сторону вулиці, щоб уникнути зустрічі з тим, кого я побачив",
  },
  {
    question:
      "Бувало, що я кидав почату справу, оскільки боявся, що я не справлюся з нею",
  },
  {
    question: "Майже щодня трапляється що-небудь, що лякає мене",
  },
  {
    question: "Навіть серед людей я зазвичай відчуваю себе самотнім",
  },
  {
    question:
      "Я переконаний, що існує лише одне єдине правильне розуміння значення життя",
  },
  {
    question:
      "В гостях я частіше сиджу де-небудь осторонь або розмовляю з ким-небудь одним, ніж беру участь у загальних розвагах",
  },
  {
    question: "Мені часто кажуть, що я запальний",
  },
  {
    question: "Буває, що я з ким-небудь пліткую",
  },
  {
    question:
      "Часто мені неприємно, коли я намагаюся застерегти кого-небудь від помилок, а мене розуміють неправильно",
  },
  {
    question: "Я часто звертаюся до людей за порадою",
  },
  {
    question:
      "Часто, навіть тоді, коли усе для мене складається добре, я відчуваю що мені усе байдуже",
  },
  {
    question: "Мене досить важко вивести з себе",
  },
  {
    question:
      "Коли я намагаюся вказати людям на їх помилки або допомогти вони часто розуміють мене неправильно",
  },
  {
    question:
      "Зазвичай я спокійний, і мене нелегко вивести з душевної рівноваги",
  },
  {
    question: "Я заслуговую суворого покарання за свою провину",
  },
  {
    question:
      "Мені притаманно так сильно переживати свої розчарування, що я не можу примусити себе не думати про них",
  },
  {
    question: "Часом мені здається, що я ні на що не здатний",
  },
  {
    question:
      "Бувало, що під час обговорення деяких питань я, особливо не замислюючись, погоджувався з думкою інших",
  },
  {
    question: "Мене дуже турбують різного роду нещастя",
  },
  {
    question: "Мої переконання і погляди непохитні",
  },
  {
    question:
      "Я вважаю, що можна не порушуючи закон спробувати знайти в ньому лазівку",
  },
  {
    question:
      "Є люди, які мені настільки неприємні, що я в глибині душі радію, коли вони одержують прочухан за що-небудь",
  },
  {
    question: "У мене бували періоди, коли через хвилювання я втрачав сон",
  },
  {
    question:
      "Я відвідую різні суспільні заходи, тому що це дозволяє бувати мені серед людей",
  },
  {
    question:
      "Можна пробачити людям порушення тих правил, які вони вважають нерозсудливими",
  },
  {
    question:
      "У мене є погані звички, які є настільки сильними, що боротися з ними просто марно",
  },
  {
    question: "Я охоче знайомлюся з новими людьми",
  },
  {
    question: "Буває, що непристойний жарт у мене викликає сміх",
  },
  {
    question:
      "Якщо справа йде у мене погано, то мені відразу хочеться все кинути",
  },
  {
    question:
      "Я вважаю за краще діяти відповідно до  власних планів, а не слідувати вказівкам інших",
  },
  {
    question: "Мені подобається, коли оточуючі знають мою точку зору.",
  },
  {
    question:
      "Якщо я поганої думки про людину або навіть зневажаю його, я мало прагну приховати це від нього",
  },
  {
    question: "Я людина нервова і легко збудлива",
  },
  {
    question: "Все у мене виходить погано, не так як треба",
  },
  {
    question: "Майбутнє здається мені безнадійним",
  },
  {
    question:
      "Люди досить легко можуть змінити мою думку, навіть якщо до цього вона здавалася мені остаточною",
  },
  {
    question:
      "Кілька разів на тиждень у мене буває таке відчуття, що повинно трапитися щось жахливе",
  },
  {
    question: "Значну частину часу я відчуваю себе втомленим",
  },
  {
    question: "Я люблю бувати на вечорах і просто в компаніях",
  },
  {
    question: "Я прагну відхилитися від конфліктів і скрутних положень",
  },
  {
    question: "Мене дуже дратує те, що я забуваю, куди кладу речі",
  },
  {
    question:
      "Пригодницькі розповіді мені подобаються більше, ніж розповіді про любов",
  },
  {
    question:
      "Якщо я схочу зробити щось, але оточуючі вважають, що цього робити не варто, я можу легко відмовитися від своїх намірів",
  },
  {
    question:
      "Безглуздо засуджувати людей, які прагнуть урвати від життя все, що можуть",
  },
  {
    question: "Мені байдуже, що про мене думають інші",
  },
  {
    question:
      "Я абсолютно не пристосований до військової служби і це мене дуже лякає",
  },
  {
    question:
      "Я переконаний, що чоловіки повинні служити у Збройних Силах тільки за власним бажанням",
  },
  {
    question:
      "Останнім часом у мене все частіше і частіше трапляються „промахи” і невдачі по службі.",
  },
  {
    question:
      "Найбільші труднощі для мене під час служби – це необхідність підкорятися командирам і начальникам",
  },
  {
    question:
      "Тим правилами, які, на мій погляд, несправедливі, я завжди прагну протидіяти",
  },
  {
    question:
      "Мені хотілося б випробувати себе серйозною і небезпечною справою",
  },
  {
    question: "Мене довго не залишає відчуття образи, заподіяне товаришами",
  },
  {
    question: "Жити за військовим розпорядком для мене просто нестерпно",
  },
  {
    question:
      "Я сумніваюся, чи зможу я зі своїм здоров'ям витримати всі навантаження військової служби",
  },
  {
    question: "Я заздрю тим, хто зміг ухилитися від військової служби",
  },
  {
    question:
      "Я відчуваю все більше і більше розчарувань по відношенню до моєї військової спеціальності",
  },
  {
    question: "Я часто розгублююся у складних і небезпечних ситуаціях",
  },
  {
    question: "Мені хотілося б служити у ПДВ або частинах спецназу",
  },
  {
    question:
      "Із службою у мене ніщо не виходить (не „клеїться”). Часто думаю: „не моя це справа”",
  },
  {
    question: "Коли мною хтось командує, це викликає у мене відчуття протесту",
  },
  {
    question: "Мені завжди було важко пристосовуватися до нового колективу",
  },
  {
    question: "Мені завжди було важко пристосовуватися до нового колективу",
  },
  {
    question:
      "Присяга на вірність Вітчизні у сучасних умовах втратила свою актуальність",
  },
  {
    question: "Мені завжди було нелегко пристосовуватися до нових умов життя",
  },
  {
    question:
      "У складних ситуаціях я не можу швидко приймати правильні рішення",
  },
  {
    question:
      "Я упевнений, що в майбутньому не стану укладати або продовжувати контракт на продовження військової служби",
  },
  {
    question:
      "У мене бувають періоди похмурої дратівливості, під час яких я „зриваю зло” на оточуючих",
  },
  {
    question:
      "Я насилу витримую фізичні навантаження, пов’язані з моєю професійною діяльністю",
  },
  {
    question:
      "Я достатньо спокійно відношуся до необхідності брати участь в тривалих і небезпечних відрядженнях",
  },
  {
    question:
      "Навряд чи я схочу присвятити все своє життя військовій професії (залишитися на службу за контрактом, поступити у військове училище)",
  },
  {
    question:
      "„За компанію” з товаришами я можу прийняти неабияку кількість алкоголю (перевищити свою звичайну „норму”)",
  },
  {
    question:
      "У компаніях, де я часто буваю, друзі іноді палять „травичку”. Я їх за це не засуджую",
  },
  {
    question:
      "Останнім часом, щоб не „зірватися”, я був вимушений приймати заспокійливі ліки",
  },
  {
    question:
      "Мої батьки (родичі) часто виказували побоювання у зв'язку з моїми випивками",
  },
  {
    question:
      "Немає нічого поганого, коли люди намагаються випробувати на собі незвичайні стани, приймаючи деякі речовини",
  },
  {
    question: "У стані агресії я здатний багато на що",
  },
  {
    question: "Я крутий і жорстокий з оточуючими",
  },
  {
    question:
      "Якщо хтось заподіяв мені зло, я вважаю зобов'язаним відплатити йому тим же („око за око, зуб за зуб”)",
  },
  {
    question:
      "Можна погодитися з тим, що я не дуже-то схильний виконувати багато наказів, вважаючи їх безрозсудними",
  },
  {
    question:
      "Я думаю, що будь-яке положення законів і військових статутів можна тлумачити двояко ",
  },
];
//questions

for (let i = 1; i <= testItems.length; i += 1) {
  testItems[i - 1].id = i;
}

const formEl = document.querySelector(".feedback-form");
const mainContainer = document.querySelector(".container");
const testsEl = document.querySelector(".tests");
const btnEl = document.querySelector(".answer-container");

const markup = testItems.map(
  ({ id, question }) =>
    `<li class="test-item">
    <p class="test-item-text"> ${id}. ${question} </p>
  </li>`
);

const monthArr = [
  "січня",
  "лтого",
  "березня",
  "квітня",
  "травня",
  "червня",
  "липня",
  "серпня",
  "вересня",
  "жовтня",
  "листопада",
  "грудня",
];

let firstCaseCounter = 0;
let secondCaseCounter = 0;
let thirdCaseCounter = 0;
let fourthCaseCounter = 0;
let fifthCaseCounter = 0;
let sixthCaseCounter = 0;
let seventCaseCounter = 0;

let numQuestion = 1;

let userName = null;

const firstCaseNo = [1, 10, 19, 31, 51, 69, 78, 92, 101, 116, 128, 138, 148];

const secondCaseYes = [
  4, 6, 7, 8, 11, 12, 15, 16, 17, 18, 20, 21, 28, 29, 30, 36, 37, 39, 40, 41,
  47, 57, 60, 63, 65, 67, 68, 70, 73, 80, 82, 83, 84, 86, 89, 94, 95, 96, 98,
  102, 103, 108, 109, 110, 111, 112, 113, 115, 117, 118, 119, 120, 122, 123,
  124, 125, 127, 129, 131, 135, 136, 137, 139, 143, 146, 149, 153, 154, 155,
  156, 157, 158, 161, 162,
];
const secondCaseNo = [
  2, 3, 5, 23, 25, 32, 38, 44, 45, 52, 53, 54, 55, 58, 62, 66, 75, 87, 105, 132,
  134, 140,
];

const thirdCaseYes = [
  9, 24, 27, 43, 46, 61, 64, 81, 88, 90, 99, 104, 106, 114, 121, 126, 133, 142,
  151, 152,
];
const thirdCaseNo = [26, 34, 35, 48, 49, 74, 85, 107, 130, 144, 147, 159];

const fourthCaseYes = [
  14, 22, 33, 42, 50, 56, 59, 71, 72, 77, 79, 91, 93, 141, 145, 150, 164, 165,
];
const fourthCaseNo = [13, 76, 97, 100, 160, 163];

const fifthCaseYes = [
  166, 167, 168, 169, 170, 172, 173, 174, 175, 176, 177, 179, 180, 181, 183,
  184, 185, 186, 187, 188, 190,
];
const fifthCaseNo = [171, 178, 182, 189];

const sixthCaseYes = [
  6, 9, 14, 15, 22, 36, 39, 42, 47, 50, 56, 59, 71, 72, 91, 93, 117, 127, 141,
  145, 151, 152, 164, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200,
];
const sixthCaseNo = [13, 100, 163];

const seventhCaseYes = [
  4, 8, 10, 28, 29, 39, 41, 47, 70, 84, 115, 119, 124, 136, 137, 149, 154, 155,
];
const seventhCaseNo = [32, 105];

alert(
  "Інструкція:  „Зараз досліджуватимуться деякі Ваші особистісні особливості. Опитувальник містить 200 тверджень (питань) про життя, роботу, відносини у сім'ї, інтереси і схильності. Ваше завдання полягає у тому, щоб визначити своє відношення до кожного ствердження, тобто погодитися або не погодитися з ним. Якщо Ви погоджуєтеся з ствердженням, то під відповідним питанням натискаєте кнопку „Так”. Якщо Ви не згодні – натискаєте „Ні”. Правильних або неправильних відповідей тут бути не може, тому довго не замислюйтеся над питанням – давайте відповідь, виходячи з того, що більше відповідає Вашому характеру або уявленню про самого себе”."
);

const handleInput = (event) => {
  userName = event.target.value;
};

const handleSubmit = (event) => {
  event.preventDefault();
  const {
    elements: { name },
  } = event.currentTarget;

  console.log(name);
  if (name.value.trim() === "") {
    alert("Введіть прізвище, ім'я, по батькові, будь ласка.");
  } else {
    console.log(userName);
    event.currentTarget.reset();
    formEl.style.display = "none";
    testsEl.innerHTML = markup[numQuestion - 1];
    btnEl.style.display = "flex";
  }
};

const clickItem = (evt) => {
  const { target } = evt;
  if (!target.classList.contains("answer-btn")) {
    return;
  }
  if (evt.target.dataset.answer === "yes") {
    if (secondCaseYes.includes(numQuestion)) {
      secondCaseCounter += 1;
    }
    if (thirdCaseYes.includes(numQuestion)) {
      thirdCaseCounter += 1;
    }
    if (fourthCaseYes.includes(numQuestion)) {
      fourthCaseCounter += 1;
    }
    if (fifthCaseYes.includes(numQuestion)) {
      fifthCaseCounter += 1;
    }
    if (sixthCaseYes.includes(numQuestion)) {
      sixthCaseCounter += 1;
    }
    if (seventhCaseYes.includes(numQuestion)) {
      seventCaseCounter += 1;
    }
  }
  if (evt.target.dataset.answer === "no") {
    if (firstCaseNo.includes(numQuestion)) {
      firstCaseCounter += 1;
    }
    if (secondCaseNo.includes(numQuestion)) {
      secondCaseCounter += 1;
    }
    if (thirdCaseNo.includes(numQuestion)) {
      thirdCaseCounter += 1;
    }
    if (fourthCaseNo.includes(numQuestion)) {
      fourthCaseCounter += 1;
    }
    if (fifthCaseNo.includes(numQuestion)) {
      fifthCaseCounter += 1;
    }
    if (sixthCaseNo.includes(numQuestion)) {
      sixthCaseCounter += 1;
    }
    if (seventhCaseNo.includes(numQuestion)) {
      seventCaseCounter += 1;
    }
  }

  if (numQuestion < markup.length) {
    testsEl.innerHTML = markup[numQuestion];
    numQuestion += 1;
  } else {
    const OAP = secondCaseCounter + thirdCaseCounter + fourthCaseCounter;
    const currentDate = new Date();
    const currentHours = currentDate.getHours().toString().padStart(2, "0");
    const currentMinutes = currentDate.getMinutes().toString().padStart(2, "0");
    const currentDays = currentDate.getDate().toString().padStart(2, "0");
    const currentMonth = monthArr.find(
      (_, index) => index === currentDate.getMonth()
    );
    const currentYear = currentDate.getFullYear();

    const result = `<p class="user"> Тест пройшов/пройшла</p>
    <p class="user">${userName}</p>
    <b class="result"> Результат №1 = ${firstCaseCounter} </b>
    <p class="result"> Результат №2 = ${secondCaseCounter} </p>
    <p class="result"> Результат №3 = ${thirdCaseCounter} </p>
    <p class="result"> Результат №4 = ${fourthCaseCounter} </p>
    <p class="result"> Результат №5 = ${fifthCaseCounter} </p>
    <p class="result"> Результат №6 = ${sixthCaseCounter} </p>
    <p class="result"> Результат №7 = ${seventCaseCounter} </p>
    <b class="result"> Основний результат = ${OAP}</b>
    <div class="date">
        <span class="time">${currentHours}:${currentMinutes}</span>
         <spanclass="time">${currentDays} ${currentMonth} ${currentYear} року</span>
    </div>`;

    mainContainer.innerHTML = result;
  }
};

formEl.addEventListener("input", handleInput);
formEl.addEventListener("submit", handleSubmit);
btnEl.addEventListener("click", clickItem);
