const testItems = [
  {
    id: 1,
    num: 1,
    question:
      "Рівень задоволеності цінностями (віра, любов, повага, довіра тощо) та їх вплив на цілі життєдіяльності, служби та засоби їх досягнення.",
  },
  {
    id: 1,
    num: 2,
    question:
      "Дотримання моральних принципів і норм в умовах службової, навчальної (навчально-бойової), бойової діяльності.",
  },
  {
    id: 1,
    num: 3,
    question:
      "Сформованість моральних якостей і національних переконань (гідність, патріотизм, відданість, доброта, обов’язковість тощо).",
  },
  {
    id: 1,
    num: 4,
    question:
      "Ступінь згуртованості, сумісності і злагодженості вашого підрозділу.",
  },
  {
    id: 1,
    num: 5,
    question:
      "Задоволеність наявністю традицій, побратимства між різними категоріями військовослужбовців.",
  },
  {
    id: 1,
    num: 6,
    question: "Рівень довіри до командування твоєї частини.",
  },
  {
    id: 1,
    num: 7,
    question: "Рівень довіри та поваги до командира підрозділу.",
  },
  {
    id: 2,
    num: 1,
    question:
      "Ступінь прояву позитивних емоцій (інтерес, радість, довіра, любов, віра, ентузіазм тощо).",
  },
  {
    id: 2,
    num: 2,
    question:
      "Ступінь прояву негативних емоцій (горе, зневага, злість, печаль, страх, паніка тощо).",
  },
  {
    id: 2,
    num: 3,
    question:
      "Ступінь відповідальності за прийняті рішення та результат своєї діяльності.",
  },
  {
    id: 2,
    num: 4,
    question:
      "Сформованість вольових якостей (витримка, наполегливість, рішучість тощо).",
  },
  {
    id: 2,
    num: 5,
    question:
      "Рівень психологічної стійкості до впливу негативних чинників бойової (екстремальної) обстановки.",
  },
  {
    id: 2,
    num: 6,
    question:
      "Оцінка свого вміння управляти діями, із яких складається виконання ваших професійних функцій та обов’язків.",
  },
  {
    id: 2,
    num: 7,
    question:
      "Рівень згуртованості, сумісності та злагодженості особового складу твого підрозділу.",
  },
  {
    id: 3,
    num: 1,
    question:
      "Самопочуття (комфортність) перебування у військовій частині (підрозділі).",
  },
  {
    id: 3,
    num: 2,
    question: "Власне фізичне самопочуття за останній місяць.",
  },
  {
    id: 3,
    num: 3,
    question: "Власне психологічне самопочуття за останній місяць.",
  },
  {
    id: 3,
    num: 4,
    question:
      "Задоволеність рівнем організації бойової підготовки у військовій частині (підрозділі).",
  },
  {
    id: 3,
    num: 5,
    question:
      "Здатність і можливість керувати своїми діями та станом у ситуаціях, а також здійснювати вплив на своїх співслужбовців (підлеглих).",
  },
  {
    id: 3,
    num: 6,
    question:
      "Рівень адекватного реагування тобою на обстановку, що різко змінюється.",
  },
  {
    id: 4,
    num: 1,
    question:
      "Рівень твоїх знань і уявлень про особливості службової (навчальної, навчально-бойової), бойової діяльності та вимог до неї.",
  },
  {
    id: 4,
    num: 2,
    question:
      "Рівень твоїх фахових знань, навичок та вмінь, необхідних для вирішення службових (навчальних, навчально-бойових), бойових проблем у межах визначених цілей і завдань.",
  },
  {
    id: 4,
    num: 3,
    question:
      "Рівень твоєї фахової підготовленості виконувати службові (функціональні) обов’язки в бойових (екстремальних) умовах в межах військово-облікової спеціальності.",
  },
  {
    id: 4,
    num: 4,
    question:
      "Оцінка рівня передачі бойового досвіду військовослужбовцями твого підрозділу.",
  },
];

export { testItems };