const testItems = [
  {
    question: "Відданість Україні, патріотизм",
  },
  {
    question: "Рівень поваги підлеглих до командира (начальника)",
  },
  {
    question: "Рівень довіри підлеглих до командира (начальника)",
  },
  {
    question: "Чесність і порядність",
  },
  {
    question: "Справедливість",
  },
  {
    question: "Вимогливість ",
  },
  {
    question: "Надійність, обов’язковість ",
  },
  {
    question: "Самовладання, стійкість",
  },
  {
    question: "Бере на себе відповідальність",
  },
  {
    question: "Рішучість",
  },
  {
    question: "Сміливість",
  },
  {
    question: "Старанність і добросовісність",
  },
  {
    question: "Принциповість, вміння відстоювати власну думку",
  },
  {
    question: "Знання техніки й озброєння",
  },
  {
    question: "Вміння управляти підлеглими ",
  },
  {
    question: "Знання своїх підлеглих",
  },
  {
    question: "Зразковість і приклад у поведінці, дисциплінованість",
  },
  {
    question: "Уважне ставлення до потреб підлеглих, турбота про них",
  },
  {
    question:
      "Прагнення досягти результату, наполегливість. Втілення рішень у реальність",
  },
  {
    question: "Вміння спілкуватися, товариськість",
  },
  {
    question: "Інтелект, ерудованість",
  },
  {
    question: "Рівень фізичного стану",
  },
  {
    question: "Володіння емоціями і волею",
  },
  {
    question: "Рівень культури й етики ",
  },
  {
    question: "Вміння вести за собою",
  },
  {
    question: "Вміння визначати мету",
  },
  {
    question: "Прагнення вдосконалювати процеси, діяти нешаблонно",
  },
  {
    question: "Впровадження нових підходів, прагнення змін на краще",
  },
  {
    question: "Вміння слухати і чути",
  },
  {
    question: "Вміння згуртовувати людей",
  },
  {
    question: "Забезпечення відпочинку людей",
  },
  {
    question: "Ініціативність, активність",
  },
  {
    question: "Доступність і щирість",
  },
  {
    question: "Дотримання моральних цінностей",
  },
  {
    question: "Розвиток і навчання підлеглих",
  },
  {
    question: "Показує приклад дій",
  },
  {
    question: "Опирається на довіру до людей ",
  },
  {
    question: "Заохочує і мотивує підлеглих ",
  },
  {
    question: "Надає допомогу ",
  },
  {
    question: "Дотримання даного слова й обіцянок",
  },
];

export { testItems };
