const testItems = [
  {
    question: "Чи робили ви ставку більше, ніж могли собі дозволити?",
  },
  {
    question:
      "Чи виникала потреба в останні 12 місяців грати на більшу суму, щоб досягти того рівня збудження, якого ви хотіли?",
  },
  {
    question:
      "Чи поверталися на наступний після програшу день до гри, щоб відіграти програні гроші?",
  },
  {
    question:
      "Чи позичали ви колись гроші, чи продавали майно, щоб мати можливість грати чи відігратись?",
  },
  {
    question:
      "Чи відчували ви коли-небудь, що у вас можуть бути проблеми з азартними іграми?",
  },
  {
    question:
      "Чи була колись азартна гра причиною ваших проблем зі здоров’ям, включаючи стрес і безпричинне занепокоєння?",
  },
  {
    question:
      "Чи критикували вас за вашу пристрасть до азартних ігор, чи казали вам, що у вас проблеми з азартними іграми, незалежно від того, чи вважали ви ці зауваження справедливими?",
  },
  {
    question:
      "Чи колись ваша пристрасть до азартних ігор була причиною фінансових проблем для вас чи вашої родини?",
  },
  {
    question:
      "Чи відчували ви колись провину за те, як ви граєте, або за те, що відбувається під час гри?",
  },
];

export { testItems };
