const testItems = [
  {
    question: "Я часто невпевнений у своїх силах.",
  },
  {
    question:
      " Нерідко мені здається безвихідним становище, з якого можна було б знайти вихід.",
  },
  {
    question: "Я часто залишаю за собою останнє слово.",
  },
  {
    question: "Мені важко змінювати свої звички.",
  },
  {
    question: "Я часто червонію через дрібниці.",
  },
  {
    question: "Неприємності мене часто засмучують, і я впадаю у розпач.",
  },
  {
    question: "Нерідко в розмові я перериваю співрозмовника.",
  },
  {
    question: "Мені важко переключитися з однієї справи на іншу.",
  },
  {
    question: "Я часто прокидаюся вночі.",
  },
  {
    question: "При великих неприємностях я беру провину на себе.",
  },
  {
    question: "Мене легко роздратувати.",
  },
  {
    question: "Я дуже обережний у зміні свого життя.",
  },
  {
    question: "Я легко впадаю у розпач.",
  },
  {
    question: "Нещастя і невдачі нічого мене не вчать.",
  },
  {
    question: "Мені доводиться часто робити зауваження іншим.",
  },
  {
    question: "У суперечці мене важко переконати.",
  },
  {
    question: "Я переймаюся навіть через уявні неприємності.",
  },
  {
    question: "Я часто відмовляюся від боротьби тому, що вважаю її марною.",
  },
  {
    question: "Я хочу бути авторитетом для оточення.",
  },
  {
    question: "Нерідко не полишають думки, яких слід було б позбутися.",
  },
  {
    question: "Мене лякають труднощі, з якими зіткнуся в житті.",
  },
  {
    question: "Нерідко почуваюся беззахисним.",
  },
  {
    question:
      "У будь-якій справі я не задовольняюся малим, а хочу досягти максимального успіху.",
  },
  {
    question: "Я легко зближуюся з людьми.",
  },
  {
    question: "Я часто звертаю увагу на свої недоліки.",
  },
  {
    question: "Інколи у мене буває пригнічений настрій.",
  },
  {
    question: "Мені важко стримувати себе, коли я гніваюсь.",
  },
  {
    question:
      "Я дуже хвилююсь, якщо в моєму житті несподівано щось змінюється.",
  },
  {
    question: "Мене легко переконати.",
  },
  {
    question: "Я відчуваю розгубленість, коли у мене виникають труднощі.",
  },
  {
    question: "Мені більше подобається керувати, а не підкорятися.",
  },
  {
    question: "Нерідко я виявляю упертість.",
  },
  {
    question: "Мене хвилює стан мого здоров'я.",
  },
  {
    question: "У скрутні хвилини я іноді поводжуся, як дитина.",
  },
  {
    question: "У мене різка жестикуляція.",
  },
  {
    question: "Я неохоче йду на ризик.",
  },
  {
    question: "Я важко витримую очікування чогось.",
  },
  {
    question: "Я думаю, що ніколи не зможу виправити своїх недоліків.",
  },
  {
    question: "Я - мстивий.",
  },
  {
    question: "Мене засмучують навіть незначні порушення моїх планів.",
  },
];

export { testItems };
