const testItems = [
  {
    question: "У Вас хороший апетит?",
  },
  {
    question: " Вранці Ви зазвичай відчуваєте, що виспалися і відпочили.",
  },
  {
    question: "У вашому повсякденному житті маса цікавого.",
  },
  {
    question: "Ви працюєте з великою напругою.",
  },
  {
    question:
      "Часом Вас приходять в голову такі нехороші думки, що про них краще не розповідати.",
  },
  {
    question: "У Вас дуже рідко буває запор.",
  },
  {
    question: "Іноді Вам дуже хотілося назавжди піти з дому.",
  },
  {
    question: "Часом у Вас бувають напади нестримного сміху або плачу.",
  },
  {
    question: "Часом Вас турбує нудота і позиви на блювоту.",
  },
  {
    question: "У вас таке враження, що Вас ніхто не розуміє.",
  },
  {
    question: "Іноді Вам хочеться вилаятися.",
  },
  {
    question: "Щотижня Вам сняться кошмари.",
  },
  {
    question: "Вам важче зосередитися, ніж більшості людей.",
  },
  {
    question: "З Вами відбувалися (або відбуваються) дивні речі.",
  },
  {
    question:
      "Ви досягли б в житті набагато більшого, якби люди не були налаштовані проти Вас.",
  },
  {
    question: "У дитинстві Ви один час скоювали крадіжки.",
  },
  {
    question:
      "Бувало, що по кілька днів, тижнів або цілих місяців Ви нічим не могли зайнятися, тому що важко було змусити себе включитися в роботу.",
  },
  {
    question: "У Вас переривчастий і неспокійний сон.",
  },
  {
    question: "Коли Ви знаходитесь серед людей, Вам чуються дивні речі.",
  },
  {
    question: "Більшість знаючих Вас людей не вважають Вас неприємною людиною.",
  },
  {
    question:
      "Вам часто доводилося підкорятися кому-небудь, хто знав менше Вашого.",
  },
  {
    question: "Більшість людей задоволені своїм життям більш, ніж Ви.",
  },
  {
    question:
      "Дуже багато перебільшують свої нещастя, щоб домогтися співчуття і допомоги.",
  },
  {
    question: "Іноді ви гнівайтесь.",
  },
  {
    question: "Вам безумовно не вистачає впевненості в собі.",
  },
  {
    question: "У вас часто бувають посмикування в м'язах.",
  },
  {
    question:
      "У Вас часто буває почуття, ніби Ви зробили щось неправильне або негарне.",
  },
  {
    question: "Зазвичай Ви задоволені своєю долею.",
  },
  {
    question:
      "Деякі так люблять командувати, що Вам хочеться все зробити наперекір, хоча Ви знаєте, що вони праві",
  },
  {
    question: "Ви вважаєте, що проти Вас щось замишляють.",
  },
  {
    question:
      "Більшість людей здатне домагатися вигоди не зовсім чесним шляхом.",
  },
  {
    question: "Вас часто турбує шлунок.",
  },
  {
    question:
      "Часто ви не можете зрозуміти, чому напередодні Ви були в поганому настрої і роздратовані.",
  },
  {
    question:
      "Часом Ваші думки текли так швидко, що Ви не встигали їх висловлювати.",
  },
  {
    question:
      "Ви вважаєте, що Ваше сімейне життя не гірше, ніж у більшості Ваших знайомих.",
  },
  {
    question: "Часом Ви впевнені у власній непотрібності.",
  },
  {
    question: "В останні роки Ваше самопочуття було в основному хорошим.",
  },
  {
    question:
      "У Вас бували періоди, під час яких Ви щось робили і потім не могли пригадати, що саме.",
  },
  {
    question: "Ви вважаєте, що Вас часто незаслужено карали.",
  },
  {
    question: "Ви ніколи не відчували себе краще, ніж тепер.",
  },
  {
    question: "Вам байдуже, що думають про Вас інші.",
  },
  {
    question: "З пам'яттю у Вас все благополучно.",
  },
  {
    question:
      "Вам важко підтримувати розмову з людиною, з якою Ви тільки що познайомилися.",
  },
  {
    question: "Велику частину часу Ви відчуваєте загальну слабкість.",
  },
  {
    question: "У Вас рідко болить голова.",
  },
  {
    question: "Іноді Вам бувало важко зберегти рівновагу при ходьбі.",
  },
  {
    question: "Не всі Ваші знайомі Вам подобаються.",
  },
  {
    question: "Є люди, які намагаються вкрасти Ваші ідеї та думки.",
  },
  {
    question: "Ви вважаєте, що робили вчинки, які не можна пробачити.",
  },
  {
    question: "Ви вважаєте, що Ви занадто сором'язливі.",
  },
  {
    question: "Ви майже завжди про що-небудь тривожитеся.",
  },
  {
    question: "Ваші батьки часто не схвалювали Ваших знайомств.",
  },
  {
    question: "Іноді Ви трохи брешете.",
  },
  {
    question: "Часом Ви відчуваєте, що Вам незвичайно легко приймати рішення.",
  },
  {
    question: "У Вас буває сильне серцебиття і Ви часто задихаєтеся.",
  },
  {
    question: "Ви запальні, але відхідливі.",
  },
  {
    question:
      "У Вас бувають періоди такого занепокоєння, що важко всидіти на місці.",
  },
  {
    question: "Ваші батьки та інші члени сім'ї часто чіпляються до Вас.",
  },
  {
    question: "Ваша доля нікого особливо не цікавить.",
  },
  {
    question:
      "Ви не засуджуєте людини, якій не проти скористатися в своїх інтересах помилками іншого.",
  },
  {
    question: "Іноді Ви сповнені енергії.",
  },
  {
    question: "За останній час у Вас погіршився зір.",
  },
  {
    question: "Часто у Вас дзвенить або шумить у вухах.",
  },
  {
    question:
      "У Вашому житті були випадки (можливо, тільки один), коли Ви відчували, що на Вас діє гіпноз.",
  },
  {
    question:
      "У Вас бувають періоди, коли Ви незвично веселі без особливої причини.",
  },
  {
    question:
      "Навіть перебуваючи в суспільстві, Ви зазвичай відчуваєте себе самотньо.",
  },
  {
    question:
      "Ви вважаєте, що майже кожен може збрехати, щоб уникнути неприємностей.",
  },
  {
    question: "Ви відчуваєте гостріше, ніж більшість інших людей.",
  },
  {
    question: "Часом Ваша голова працює як би повільніше, ніж зазвичай.",
  },
  {
    question: "Ви часто розчаровуєтеся в людях.",
  },
  {
    question: "Ви зловживаєте спиртними напоями.",
  },
];

export { testItems };