const testItems = [
  {
    id: 1,
    question: "Як би Ви оцінили свою причетність до колективу?",
    answers: [{
        answer: "почуваюся частиною колективу;",
        mark: 5,
    },
      {
          answer: "беру участь у житті і діяльності колективу;",
          mark: 4,
      }, {
          answer:
            "беру участь в одних видах діяльності та не беру участі в інших;",
          mark: 3,
      }, {
          answer: "не відчуваю, що я член колективу;",
          mark: 2,
      }, {
          answer: "живу та існую окремо від колективу;",
          mark: 1,
      }, {
          answer: "не знаю, важко відповісти.",
          mark: 0,
        }]
  },
  {
    id: 2,
    question:
      "Чи перейшли б Ви в інший колектив, якби випала така нагода (без зміни інших умов)?",
    answers: [{
        answer: "так, дуже хотів би перейти;",
        mark: 1,
    }, {
          answer: "швидше перейшов би, ніж залишився;",
          mark: 2,
      }, {
          answer: "не бачу жодної різниці;",
          mark: 3,
      }, {
          answer: "швидше за все, залишився б у своєму колективі;",
          mark: 4,
      }, {
          answer: "дуже хотів би залишитися у своєму колективі;",
          mark: 5,
      },{
        answer: "не знаю, важко сказати.",
        mark: 1,
    }]
  },
  {
    id: 3,
    question: "Які відносини між членами Вашого колективу?",
    answers: [{
        answer: "краще, ніж у більшості колективів;",
        mark: 3,
    }, {
          answer: "приблизно такі ж, як і в більшості колективів;",
          mark: 2,
      }, {
          answer: "гірше, ніж у більшості колективів;",
          mark: 1,
      }, {
          answer: "не знаю, важко сказати.",
          mark: 1,
      }]
  },
  {
    id: 4,
    question: " Які у Вас взаємини з командуванням?",
    answers: [{
        answer: "краще, ніж у більшості колективів;",
        mark: 3,
    }, {
          answer: "приблизно такі ж, як і в більшості колективів;",
          mark: 2,
      }, {
          answer: "гірше, ніж у більшості колективів;",
          mark: 1,
      }, {
          answer: "не знаю.",
          mark: 1,
      },]
  },
  {
    id: 5,
    question: "Яке ставлення до справи (захисту Вітчизни) у Вашому колективі?",
    answers: [{
        answer: "краще, ніж у більшості колективів;",
        mark: 3,
    }, {
          answer: "приблизно такі ж, як і в більшості колективів;",
          mark: 2,
      }, {
          answer: "гірше, ніж у більшості колективів;",
          mark: 1,
      },{
        answer: "не знаю.",
        mark: 1,
      },]
  },
];

export { testItems };
