const testItems = [
  {
    question:
      "Як Ви вважаєте, чи може життя втратити цінність для людини в певній ситуації?",
  },
  {
    question: "Життя іноді гірше смерті.",
  },
  {
    question: "У минулому в мене була спроба піти з життя.",
  },
  {
    question: "Мене багато хто любить, розуміє та цінує.",
  },
  {
    question:
      "Можна виправдати безнадійно хворих, що обрали добровільну смерть.",
  },
  {
    question: "Я не думаю, що сам можу опинитися в безнадійному становищі.",
  },
  {
    question:
      "Сенс життя не завжди буває ясний, його можна іноді втратити або не знайти.",
  },
  {
    question:
      "Як Ви вважаєте, опинившись у ситуації, коли Вас зрадили близькі та рідні, Ви зможете жити далі?",
  },
  {
    question: "Я іноді думаю про свою добровільну смерть.",
  },
  {
    question:
      "У будь-якій ситуації я буду боротися за своє життя, чого б мені це не коштувало.",
  },
  {
    question: "Завжди і скрізь намагаюся бути абсолютно чесною людиною.",
  },
  {
    question: "У мене, в принципі, немає недоліків.",
  },
  {
    question: "Можливо, далі я жити не зможу.",
  },
  {
    question:
      "Дивно, що деякі люди, опинившись у безвихідному становищі, не хочуть покінчити з життям.",
  },
  {
    question:
      "Почуття приреченості в підсумку призводить до добровільного позбавлення себе життя.",
  },
  {
    question: "Якщо буде потрібно, то можна виправдати позбавлення себе життя.",
  },
  {
    question: "Мені не подобається грати зі смертю наодинці",
  },
  {
    question: "Часто перше враження про людину є визначальним.",
  },
  {
    question: "Я пробував різні способи позбавлення себе життя.",
  },
  {
    question: "У критичний момент я завжди можу впоратися з собою.",
  },
  {
    question:
      "У школі я завжди відрізнявся (відрізнялася) тільки гарною поведінкою.",
  },
  {
    question: "Можу обманювати оточуючих, щоб погіршити своє становище.",
  },
  {
    question: "Навколо мене досить багато нечесних людей.",
  },
  {
    question: "Одного разу я обирав декілька способів покінчити з життям.",
  },
  {
    question: "Досить часто мене намагаються обдурити або ввести в оману.",
  },
  {
    question: "Я б не хотів моментальної смерті після важких переживань.",
  },
  {
    question: "Я продовжив би жити далі, якби трапилася світова ядерна війна.",
  },
  {
    question:
      "Людина вільна чинити зі своїм життям так, як їй хочеться, навіть якщо вона обирає смерть.",
  },
  {
    question:
      "Якщо людина не вміє подати себе у вигідному ракурсі перед керівництвом, то вона багато чого втрачає.",
  },
  {
    question: "Нікому й ніколи не писав передсмертну записку.",
  },
  {
    question: "Одного разу намагався накласти на себе руки.",
  },
  {
    question: "Ніколи не буває безвихідних ситуацій.",
  },
  {
    question:
      "Пробував покінчити з життям таким чином, щоб не відчувати сильного болю.",
  },
  {
    question:
      "Треба вміти приховувати свої думки від інших, навіть якщо вони до мене байдужі.",
  },
  {
    question:
      "Душа людини напевно відчуває полегшення, якщо сама залишає цей світ.",
  },
  {
    question: "Можу виправдати будь-який свій вчинок.",
  },
  {
    question:
      "Якщо я щось роблю, а мені починають заважати, то я все одно буду робити те, що задумав.",
  },
  {
    question:
      "Щоб людині позбутися від невиліковної хвороби та перестати мучитися, вона, напевно, повинна сама припинити свої страждання та піти з цього життя добровільно.",
  },
  {
    question: "Буває, сумніваюся в психічному здоров’ї деяких моїх знайомих.",
  },
  {
    question: "Одного разу наважувався покінчити з життям.",
  },
  {
    question: "Мене турбує відсутність відчуття щастя.",
  },
  {
    question: "Я ніколи не йду на порушення закону, навіть у дрібницях.",
  },
  {
    question: "Іноді мені хочеться заснути й не прокинутися.",
  },
  {
    question: "Одного разу мені було дуже соромно через те, що хотілося піти з життя.",
  },
  {
    question: "Навіть у найважчій ситуації я буду боротися за своє життя, чого б мені це не коштувало.",
  },
];

export { testItems };
