const testItems = [
  {
    id: 1,
    answers: [
      {
        answer: "Мені не сумно",
        mark: 0,
      },
      {
        answer: "Значну частину часу мені сумно",
        mark: 1,
      },
      {
        answer: "Я увесь час почуваюсь сумним, пригніченим",
        mark: 2,
      },
      {
        answer: "Я відчуваю нестерпний сум та тугу",
        mark: 3,
      },
    ],
  },
  {
    id: 2,
    answers: [
      {
        answer: "Я не вважаю, що заслуговую покарання",
        mark: 0,
      },
      {
        answer: "Я допускаю, що заслуговую покарання",
        mark: 1,
      },
      {
        answer: "Я вважаю, що маю бути покараний",
        mark: 2,
      },
      {
        answer: "Я відчуваю, що доля карає мене",
        mark: 3,
      },
    ],
  },
  {
    id: 3,
    answers: [
      {
        answer: "Я спокійно думаю про майбутнє",
        mark: 0,
      },
      {
        answer:
          "Думки про майбутнє викликають в мене занепокоєння більше, ніж раніше",
        mark: 1,
      },
      {
        answer: "Мені нема чого чекати від майбутнього і на що надіятися",
        mark: 2,
      },
      {
        answer:
          "Я відчуваю, що в моєму майбутньому нема нічого доброго і я нічого не можу змінити",
        mark: 3,
      },
    ],
  },
  {
    id: 4,
    answers: [
      {
        answer: "Я не відчуваю себе невдахою",
        mark: 0,
      },
      {
        answer: "В минулому я мав би менше зазнавати невдач",
        mark: 1,
      },
      {
        answer: "Моє життя – це суцільна низка невдач та помилок.",
        mark: 2,
      },
      {
        answer:
          "Я абсолютний невдаха в усьому (навчанні, праці, сімейному житті і т.д.)",
        mark: 3,
      },
    ],
  },
  {
    id: 5,
    answers: [
      {
        answer: "Я в основному задоволений тим, ким я є.",
        mark: 0,
      },
      {
        answer: "Я втратив впевненість у собі",
        mark: 1,
      },
      {
        answer: "Я розчарований в собі",
        mark: 2,
      },
      {
        answer: "Я не люблю себе",
        mark: 3,
      },
    ],
  },
  {
    id: 6,
    answers: [
      {
        answer: "Я отримую задоволення від улюблених занять і речей",
        mark: 0,
      },
      {
        answer:
          "Я не отримую такого задоволення, як раніше від улюблених занять та речей",
        mark: 1,
      },
      {
        answer:
          "Я отримую дуже мало задоволення від того, що зазвичай мене тішило",
        mark: 2,
      },
      {
        answer:
          "Я не можу отримати задоволення від того, що зазвичай мене тішило",
        mark: 3,
      },
    ],
  },
  {
    id: 7,
    answers: [
      {
        answer: "Я критикую і звинувачую себе не більше, ніж зазвичай",
        mark: 0,
      },
      {
        answer: "Я більш критичний до себе, ніж зазвичай",
        mark: 1,
      },
      {
        answer: "Я критикую себе за всі свої помилки",
        mark: 2,
      },
      {
        answer: "Я звинувачую себе у всьому поганому, що відбувається",
        mark: 3,
      },
    ],
  },
  {
    id: 8,
    answers: [
      {
        answer: "Я не відчуваю відчуття провини",
        mark: 0,
      },
      {
        answer: "Я відчуваю почуття провини за багато речей, зроблених мною",
        mark: 1,
      },
      {
        answer:
          "Я дуже часто відчуваю себе поганою людиною і мене мучить відчуття провини",
        mark: 2,
      },
      {
        answer: "Мене мучить постійне відчуття провини",
        mark: 3,
      },
    ],
  },
  {
    id: 9,
    answers: [
      {
        answer: "У мене не виникає думок про самогубство",
        mark: 0,
      },
      {
        answer:
          "У мене бувають думки про самогубство, але я знаю, що не зроблю цього",
        mark: 1,
      },
      {
        answer: "Я хочу вмерти і планую самогубство",
        mark: 2,
      },
      {
        answer: "Якщо б була нагода, я б зробив самогубство",
        mark: 3,
      },
    ],
  },
  {
    id: 10,
    answers: [
      {
        answer: "Я не більш неспокійний або збуджений, ніж зазвичай",
        mark: 0,
      },
      {
        answer: "Я відчуваю більше занепокоєння і збудження, ніж зазвичай",
        mark: 1,
      },
      {
        answer:
          "Я відчуваю таке занепокоєння і збудження, що мені важко сидіти спокійно",
        mark: 2,
      },
      {
        answer:
          "Я відчуваю таке занепокоєння і збудження, що змушений весь час рухатися або щось робити",
        mark: 3,
      },
    ],
  },
  {
    id: 11,
    answers: [
      {
        answer: "Я не плачу більш часто, ніж звичайно",
        mark: 0,
      },
      {
        answer: "Я плачу частіше, ніж звичайно",
        mark: 1,
      },
      {
        answer: "Я плáчу кожен день по кожному незначному приводу",
        mark: 2,
      },
      {
        answer: "Я хочу плакати, але не можу",
        mark: 3,
      },
    ],
  },
  {
    id: 12,
    answers: [
      {
        answer: "Я не втратив цікавості до інших людей і занять",
        mark: 0,
      },
      {
        answer: "Люди і речі цікавлять мене менше, ніж раніше.",
        mark: 1,
      },
      {
        answer: "Я значною мірою втратив цікавість до інших людей і занять",
        mark: 2,
      },
      {
        answer: "Мене важко чимось зацікавити",
        mark: 3,
      },
    ],
  },
  {
    id: 13,
    answers: [
      {
        answer: "Я не дратуюсь частіше, ніж звичайно",
        mark: 0,
      },
      {
        answer: "Я дратуюся легше, ніж звичайно",
        mark: 1,
      },
      {
        answer: "Я дратуюся значно легше, ніж звичайно",
        mark: 2,
      },
      {
        answer: "Я постійно відчуваю роздратування",
        mark: 3,
      },
    ],
  },
  {
    id: 14,
    answers: [
      {
        answer: "Мені не є важче, ніж звичайно приймати рішення",
        mark: 0,
      },
      {
        answer: "Тепер частіше, ніж раніше я зволікаю з прийняттям рішень",
        mark: 1,
      },
      {
        answer: "Мені дуже важко прийняти будь-яке рішення",
        mark: 2,
      },
      {
        answer: "Я не в стані приймати жодних рішень",
        mark: 3,
      },
    ],
  },
  {
    id: 15,
    answers: [
      {
        answer: " У мене хороший апетит",
        mark: 0,
      },
      {
        answer: "Мій апетит гірший, ніж раніше",
        mark: 1,
      },
      {
        answer: "Мій апетит набагато гірший, ніж раніше",
        mark: 2,
      },
      {
        answer: "У мене взагалі немає апетиту",
        mark: 3,
      },
    ],
  },
  {
    id: 16,
    answers: [
      {
        answer: "Я не відчуваю себе нікчемним",
        mark: 0,
      },
      {
        answer: "Я не відчуваю себе таким же цінним і корисним, як завжди",
        mark: 1,
      },
      {
        answer: "Я відчуваю себе менш цінним, ніж інші",
        mark: 2,
      },
      {
        answer: "Я відчуваю себе повністю нікчемним",
        mark: 3,
      },
    ],
  },
  {
    id: 17,
    answers: [
      {
        answer: "Я так само добре можу зосередитися, як завжди",
        mark: 0,
      },
      {
        answer: "Я не можу так само добре зосередитися, як завжди",
        mark: 1,
      },
      {
        answer: "Мені важко довго утримувати увагу на чому-небудь",
        mark: 2,
      },
      {
        answer: "Я не можу зосередитися ні на чому",
        mark: 3,
      },
    ],
  },
  {
    id: 18,
    answers: [
      {
        answer: "Я так само енергійний, як зазвичай",
        mark: 0,
      },
      {
        answer: "У мене менше енергії, ніж зазвичай",
        mark: 1,
      },
      {
        answer:
          "У мене недостатньо енергії, щоб зробити багато чого з того, що потрібно",
        mark: 2,
      },
      {
        answer: "У мене немає сил ні на що",
        mark: 3,
      },
    ],
  },
  {
    id: 19,
    answers: [
      {
        answer: "Я втомлююся не більш, ніж зазвичай",
        mark: 0,
      },
      {
        answer: "Я втомлююся значно легше, ніж раніше",
        mark: 1,
      },
      {
        answer:
          "Через втому я не можу виконувати багато звичних для мене справ",
        mark: 2,
      },
      {
        answer:
          "Через втому я не можу виконувати більшість звичних для мене справ",
        mark: 3,
      },
    ],
  },
  {
    id: 20,
    answers: [
      {
        answer: "Я сплю так само добре, як раніше",
        mark: 0,
      },
      {
        answer: "Я почав гірше спати і прокидаюся втомленим",
        mark: 1,
      },
      {
        answer: "Я рано прокидаюся і відчуваю, що не виспався",
        mark: 2,
      },
      {
        answer: "Я прокидаюся кілька разів за ніч і більше не можу заснути",
        mark: 3,
      },
    ],
  },
  {
    id: 21,
    answers: [
      {
        answer: "Мій інтерес до статевого життя за останній час не зменшився",
        mark: 0,
      },
      {
        answer: "Статеве життя мене цікавить зараз менше, ніж звичайно",
        mark: 1,
      },
      {
        answer: "Мій інтерес до статевого життя значно зменшився",
        mark: 2,
      },
      {
        answer: "Я повністю втратив інтерес до статевого життя",
        mark: 3,
      },
    ],
  },
];

export { testItems };
