const testItems = [
  {
    id: 1,
    question: "Печаль, що спостерігається:",
    answers: [
      {
        answer: "печаль відсутня",
        mark: 0,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 1,
      },
      {
        answer: "виглядаю пригніченим, але легко відволікаюсь",
        mark: 2,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 3,
      },
      {
        answer: "печальний і нещасний більшу частину часу",
        mark: 4,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 5,
      },
      {
        answer:
          "виглядаю печальним постійно, надзвичайно пригнічений і нещасний",
        mark: 6,
      },
    ],
  },
  {
    id: 2,
    question: "Печаль, що висловлюється:",
    answers: [
      {
        answer: "не часта печаль, що зумовлена обставинами",
        mark: 0,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 1,
      },
      {
        answer: "печальний, але легко відволікаюсь",
        mark: 2,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 3,
      },
      {
        answer:
          "переважають печальні або похмурі почуття, настрій визначається впливом зовнішніх (несприятливих) обставин",
        mark: 4,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 5,
      },
      {
        answer: "постійна печаль, страждання або відчай",
        mark: 6,
      },
    ],
  },
  {
    id: 3,
    question: "Внутрішня напруга:",
    answers: [
      {
        answer: "спокійний; лише швидкоплинне внутрішнє напруження",
        mark: 0,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 1,
      },
      {
        answer: "не часте почуття внутрішнього дискомфорту",
        mark: 2,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 3,
      },
      {
        answer:
          "постійне відчуття внутрішньої напруги або паніки, з яким  важко справлятись",
        mark: 4,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 5,
      },
      {
        answer: "жорстокий жах або мука, непереборна паніка",
        mark: 6,
      },
    ],
  },
  {
    id: 4,
    question: "Погіршення сну:",
    answers: [
      {
        answer: "сплю як зазвичай",
        mark: 0,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 1,
      },
      {
        answer:
          "малопомітні труднощі із засинанням, злегка порушений або переривчастий сон",
        mark: 2,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 3,
      },
      {
        answer: "сон порушений принаймні протягом двох годин",
        mark: 4,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 5,
      },
      {
        answer: "менш ніж дво- або тригодинний сон",
        mark: 6,
      },
    ],
  },
  {
    id: 5,
    question: "Порушення апетиту:",
    answers: [
      {
        answer: "нормальний або підвищений апетит",
        mark: 0,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 1,
      },
      {
        answer: "трохи знижений апетит",
        mark: 2,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 3,
      },
      {
        answer: "відсутність апетиту, їжа позбавлена смаку",
        mark: 4,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 5,
      },
      {
        answer: "харчуюсь примусово",
        mark: 6,
      },
    ],
  },
  {
    id: 6,
    question: "Труднощі концентрації:",
    answers: [
      {
        answer: "відсутні",
        mark: 0,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 1,
      },
      {
        answer: "не часте утруднення уваги",
        mark: 2,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 3,
      },
      {
        answer:
          "труднощі концентрації, нав’язливі думки, які заважають читати або підтримувати розмову",
        mark: 4,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 5,
      },
      {
        answer: "нездатність читати, значні труднощі при бесіді",
        mark: 6,
      },
    ],
  },
  {
    id: 7,
    question: "Втома:",
    answers: [
      {
        answer: "труднощі на початку діяльності, сумнівні, млявості немає",
        mark: 0,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 1,
      },
      {
        answer: "труднощі розпочати активну діяльність",
        mark: 2,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 3,
      },
      {
        answer: "труднощі почати рутинні дії, пов’язані з витрачанням сил",
        mark: 4,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 5,
      },
      {
        answer:
          "сильна млявість, нездатність робити хоч що-небудь без допомоги",
        mark: 6,
      },
    ],
  },
  {
    id: 8,
    question: "Нездатність переживати почуття:",
    answers: [
      {
        answer: "нормальний інтерес до всього, що оточує та до людей",
        mark: 0,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 1,
      },
      {
        answer:
          "зниження здатності отримувати задоволення від звичайних інтересів",
        mark: 2,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 3,
      },
      {
        answer:
          "низький інтерес до всього, що оточує, зниження почуттів до друзів і близьких",
        mark: 4,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 5,
      },
      {
        answer:
          "явища емоційного паралічу, нездатність відчувати гнів, горе або задоволення, болісна відсутність почуттів до родичів і друзів",
        mark: 6,
      },
    ],
  },
  {
    id: 9,
    question: "Песимістичні думки:",
    answers: [
      {
        answer: "відсутні",
        mark: 0,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 1,
      },
      {
        answer: "непостійні ідеї про невдачі, самодокори або самоосуд",
        mark: 2,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 3,
      },
      {
        answer:
          "повторюване самозвинувачення або ясні, але раціональні ідеї провини або гріховності, наростання песимізму щодо майбутнього",
        mark: 4,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 5,
      },
      {
        answer:
          "марення загибелі або неспокутого гріха, абсурдне і непохитне самозвинувачення",
        mark: 6,
      },
    ],
  },
  {
    id: 10,
    question: "Суїцидальні думки:",
    answers: [
      {
        answer:
          "отримує задоволення від життя або сприймає його таким, як воно є",
        mark: 0,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 1,
      },
      {
        answer: "втома від життя, швидкоплинні суїцидальні думки",
        mark: 2,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 3,
      },
      {
        answer:
          "можлива вигода від смерті, загальноприйняті суїцидальні думки, суїцид розглядається як можливе рішення, але без спеціальних планів і цілей",
        mark: 4,
      },
      {
        answer:
          "проміжна відповідь (якщо Ваш стан частково відповідає попередньому опису і частково — наступному)",
        mark: 5,
      },
      {
        answer:
          "явні суїцидальні наміри (якщо випаде нагода), активна підготовка до самогубства",
        mark: 6,
      },
    ],
  },
];

export { testItems };
